In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'col1': [1,2,3,4],
                   'col2': [230,150,400,230],
                   'col3': ['A','B','C','D']})

In [3]:
df

   col1  col2 col3
0     1   230    A
1     2   150    B
2     3   400    C
3     4   230    D

In [4]:
# Now lets perform some pandas operation on this df
# 230 is repeating so its gonna print only once because we are printing unique values
df['col2'].unique()

array([230, 150, 400], dtype=int64)

In [5]:
# counting values
df['col2'].value_counts()

col2
230    2
150    1
400    1
Name: count, dtype: int64

In [9]:
# we have 3 unique values in col2
len(df['col2'].value_counts())

3

In [11]:
def time_two(number):
    return number * 2

In [14]:
#lets apply this above function to our df
df['NEW'] = df['col1'].apply(time_two)

In [15]:
# Two has been multiplied to the 2nd column
df

   col1  col2 col3  NEW
0     1   230    A    2
1     2   150    B    4
2     3   400    C    6
3     4   230    D    8

In [21]:
# now lets delete the new column from df
df.drop('NEW',axis=1,inplace=True)

In [22]:
df

   col1  col2 col3
0     1   230    A
1     2   150    B
2     3   400    C
3     4   230    D

In [23]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [24]:
df.index

RangeIndex(start=0, stop=4, step=1)